src/DataProcessors/КонсольЗапросов/КонсольЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонсольЗапросов</name>
  <attributes>
    <name>АвтосохранениеПриЗакрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВосстанавливатьРезультатЗапросаПриАктивизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКолонкуУИДДляСсылочныхТипов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьВременныеТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла XML, где хранятся запросы и параметры.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФормам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запросы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресРезультатаЗапроса</name>
      <comment>Адрес результата запроса во временном  хранилище</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗапроса</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/КонсольЗапросов/Forms/Настройки/Module.bsl
///////////////////////////////////////////////////////////////////////////
// ОБЩИЕ КОМАНДЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры); 
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ПередаваемыеНастройки = Новый Структура;
	ПередаваемыеНастройки.Вставить("АвтосохранениеПриЗакрытии", Объект.АвтосохранениеПриЗакрытии);
	ПередаваемыеНастройки.Вставить("НеВыводитьВременныеТаблицы", Объект.НеВыводитьВременныеТаблицы);
	ПередаваемыеНастройки.Вставить("ДобавлятьКолонкуУИДДляСсылочныхТипов", Объект.ДобавлятьКолонкуУИДДляСсылочныхТипов);
	ПередаваемыеНастройки.Вставить("ВосстанавливатьРезультатЗапросаПриАктивизации", Объект.ВосстанавливатьРезультатЗапросаПриАктивизации);
	
	// Передача в открывающую форму.
	Закрыть(ПередаваемыеНастройки); 

КонецПроцедуры
